type RoomItem = {
  name: string
  alias?: Array<string> | string
} | string

const chinaCountryMap = {
  "重庆市": ['渝中区', '万州区', '大渡口区', '江北区', '沙坪坝区', '九龙坡区', '南岸区', '北碚区', '万盛区', '双桥区', '渝北区', '巴南区', '涪陵区', '黔江区', '长寿区', '江津', '合川', '南川', '綦江', '潼南', '铜梁', '大足', '壁山', '垫江', '荣昌', '武隆', '丰都', '城口', '梁平', '开县', '巫溪', '巫山', '奉节', '云阳', '忠县', '酉阳', '石柱', '秀山', '彭水'],
  "北京市": ['东城区', '西城区', '崇文区', '宣武区', '朝阳区', '丰台区', '石景山区', '海淀区', '门头沟区', '房山区', '通州区', '顺义区', '昌平区', '大兴区', '怀柔区', '平谷区', '密云', '延庆'],
  "江苏省": ['南京', '徐州', '连云港', '宿迁', '淮安', '盐城', '扬州', '泰州', '南通', '镇江', '常州', '无锡', '苏州', '江阴', '宜兴', '邳州', '新沂', '金坛', '溧阳', '常熟', '张家港', '太仓', '昆山', '吴江', '如皋', '通州', '海门', '启东', '大丰', '东台', '高邮', '仪征', '江都', '扬中', '句容', '丹阳', '兴化', '姜堰', '泰兴', '靖江'],
  "安徽省": ['合肥', '宿州', '淮北', '阜阳', '蚌埠', '淮南', '滁州', '马鞍山', '芜湖', '铜陵', '安庆', '黄山', '六安', '巢湖', '池州', '宣城', '亳州'],
  "江西省": ['南昌', '九江', '景德镇', '鹰潭', '新余', '萍乡', '赣州', '上饶', '抚州', '宜春', '吉安'],
  "浙江省": ['杭州', '宁波', '湖州', '嘉兴', '舟山', '绍兴', '衢州', '金华', '台州', '温州', '丽水'],
  "福建省": ['厦门', '福州', '南平', '三明', '莆田', '泉州', '漳州', '龙岩', '宁德'],
  "河南省": ['郑州', '开封', '洛阳', '平顶山', '安阳', '鹤壁', '新乡', '焦作', '濮阳', '许昌', '漯河', '三门峡', '南阳', '商丘', '周口', '驻马店', '信阳'],
  "山东省": [ '济南', '青岛', '聊城', '德州', '东营', '淄博', '潍坊', '烟台', '威海', '日照', '临沂', '枣庄', '济宁', '泰安', '莱芜', '滨州', '菏泽'],
  "广东省": ['广州', '深圳', '清远', '韶关', '河源', '梅州', '潮州', '汕头', '揭阳', '汕尾', '惠州', '东莞', '珠海', '中山', '江门', '佛山', '肇庆', '云浮', '阳江', '茂名', '湛江'],
  "天津市": ['和平区', '河东区', '河西区', '南开区', '河北区', '红桥区', '塘沽区', '汉沽区', '大港区', '东丽区', '西青区', '津南区', '北辰区', '武清区', '宝坻区', '蓟县', '宁河', '静海'],
  "上海市": ['黄浦区', '卢湾区', '徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '虹口区', '杨浦区', '闵行区', '嘉定区', '浦东新区', '宝山区', '金山区', '松江区', '青浦区', '南汇区', '奉贤区', '崇明'],
  "河北省": ['石家庄', '唐山', '秦皇岛', '邯郸', '邢台', '保定', '张家口', '承德', '沧州', '廊坊', '衡水'],
  "山西省": ['太原', '大同', '阳泉', '长治', '晋城', '朔州', '晋中', '运城', '忻州', '临汾', '吕梁'],
  "辽宁省": ['沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛'],
  "吉林省": ['长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '延边'],
  "黑龙江省": ['哈尔滨', '齐齐哈尔', '鸡西', '鹤岗', '双鸭山', '大庆', '伊春', '佳木斯', '七台河', '牡丹江', '黑河', '绥化', '大兴安岭地区'],
  "湖北省": ['武汉', '黄石', '十堰', '宜昌', '襄阳', '鄂州', '荆门', '孝感', '荆州', '黄冈', '咸宁', '随州', '恩施土家族苗族'],
  "湖南省": ['长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德', '张家界', '益阳', '郴州', '永州', '怀化', '娄底', '湘西土家族苗族'],
  "海南省": ['海口', '三亚', '三沙'],
  "四川省": ['成都', '自贡', '攀枝花', '泸州', '德阳', '绵阳', '广元', '遂宁', '内江', '乐山', '南充', '眉山', '宜宾', '广安', '达州', '雅安', '巴中', '资阳', '阿坝藏族羌族', '甘孜藏族', '凉山彝族'],
  "贵州省": ['贵阳', '六盘水', '遵义', '安顺', '铜仁', '黔西南布依族苗族', '毕节', '黔东南苗族侗族', '黔南布依族苗族'],
  "云南省": ['昆明', '曲靖', '玉溪', '保山', '昭通', '丽江', '普洱', '临沧', '楚雄彝族', '红河哈尼族彝族', '文山壮族苗族', '西双版纳傣族', '大理白族', '德宏傣族景颇族', '怒江傈僳族', '迪庆藏族'],
  "陕西省": ['西安', '铜川', '宝鸡', '咸阳', '渭南', '延安', '汉中', '榆林', '安康', '商洛'],
  "甘肃省": ['兰州', '嘉峪关', '金昌', '白银', '天水', '武威', '张掖', '平凉', '酒泉', '庆阳', '定西', '陇南', '临夏回族', '甘南藏族'],
  "青海省": ['西宁', '海东', '海北藏族', '黄南藏族', '海南藏族', '果洛藏族', '玉树藏族', '海西蒙古族藏族'],
  "台湾省": ['台北', '高雄', '台南', '台中', '金门', '南投', '基隆', '新竹', '嘉义', '新北', '宜兰', '新竹', '桃园', '苗栗', '彰化', '嘉义', '云林', '屏东', '台东', '花莲', '澎湖', '连江'],
  "内蒙古自治区": ['呼和浩特', '包头', '乌海', '赤峰', '通辽', '鄂尔多斯', '呼伦贝尔', '巴彦淖尔', '乌兰察布', '兴安盟', '锡林郭勒盟', '阿拉善盟'],
  "西藏自治区": ['拉萨', '昌都', '山南地区', '日喀则', '那曲地区', '阿里地区', '林芝'],
  "广西壮族自治区": ['南宁', '柳州', '桂林', '梧州', '北海', '防城港', '钦州', '贵港', '玉林', '百色', '贺州', '河池', '来宾', '崇左'],
  "宁夏回族自治区": ['银川', '石嘴山', '吴忠', '固原', '中卫'],
  "新疆维吾尔自治区": ['乌鲁木齐', '克拉玛依', '吐鲁番', '哈密地区', '昌吉回族', '博尔塔拉蒙古', '巴音郭楞蒙古', '阿克苏地区', '克孜勒苏柯尔克孜', '喀什地区', '和田地区', '伊犁哈萨克', '塔城地区', '阿勒泰地区'],
  "香港特别行政区": ['香港岛', '九龙', '新界'],
  "澳门特别行政区": ['澳门半岛', '离岛']
}

const companyList = [
  {name: '中国', floorMap: chinaCountryMap},
]

interface IRoomInformation {
  roomList: Array<string>
  aliasMap: Map<string, string>
  locationMap: Map<string, string>
}

function useRoomInformation(): IRoomInformation {
  const roomList: Array<string> = []
  const aliasMap = new Map<string, string>()
  const locationMap = new Map<string, string>()

  /**
   * 添加房间
   * @param room 房间
   * @param floor 房间所在楼层
   * @param company 房间所在公司大楼
   */
  function addRoom(room: RoomItem, floor: string, company: string) {
    const roomName = typeof room !== 'string' ? room.name : room

    roomList.push(roomName)
    locationMap.set(roomName.toLowerCase(), `${company}-${floor}-${roomName}`)

    if (typeof room === 'string') { // 不含有别名
      return
    }

    if (typeof room.alias === 'string') {
      aliasMap.set(room.alias.toLowerCase(), room.name)
      return roomList.push(room.alias)
    }
    room.alias.forEach(aliasName => {
      aliasMap.set(aliasName.toLowerCase(), room.name)
      roomList.push(aliasName)
    })
  }

  companyList.forEach(({name, floorMap}) => {
    const floorList = Reflect.ownKeys(floorMap)

    floorList.forEach((floor: string) => {
      floorMap[floor].forEach(room => addRoom(room, floor, name))
    })
  })

  return {
    roomList,
    aliasMap,
    locationMap
  }
}

export default useRoomInformation












